Revit 2027 API
RenderingSettings.GetBackgroundSettings Method
 Returns an object that represents the rendering background settings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public BackgroundSettings GetBackgroundSettings()
Public Function GetBackgroundSettings As BackgroundSettings
public:
BackgroundSettings^ GetBackgroundSettings()
member GetBackgroundSettings : unit -> BackgroundSettings
Return Value
BackgroundSettings
 The rendering background settings.
Remarks
 Different kind of settings object will be returned according to different background style. It could be SkyBackgroundSettings, ColorBackgroundSettings, or ImageBackgroundSettings.
See Also
Reference
RenderingSettings Class
Autodesk.Revit.DB Namespace